<!DOCTYPE html>
<html  lang="es">
<head>
	<title>FASES DEL DESARROLLO WEB</title>
	<meta charset="utf-8" />
</head>

<body bgcolor="skyblue">
	<p align="right" style="color:purple">Wendy Cortez</p>

	<nav>
        <label for="check" class="checkbtn">
        	<i class="fas fa-bars">
        	</i>
        </label>
        <ul>
        	<i>
            <li><a class="boton" href="file:///C:/MisSitiosWeb/www.ch11049.tpi/index.html" style="color:darkgreen;"><strong><font size="+1">INICIO</font> </strong></a></li><br>
        </i>
        </ul>
    </nav>
<font size="+3"><strong>
	<p align="center" style="color:blue">FASES DEL DESARROLLO DE SOFTWARE</p>
	</strong>
	</font>
     <h2>Fase1: Analis&iacute;s</h2>

<font size="+2">
     <p>* En esta fase se debe identificar el proposito del sitio web, los objetivos y el p&uacute;blico al que ir&aacute; dirigido.</p>
</font>
      <IMG HEIGHT="550"  SRC="img1.png"
       WIDTH="850"BORDER="0" align="right"
       HSPACE="30">

       <h2>Fase2: Planificaci&oacute;n</h2>
       <font size="+2">
       <p>* Es importante definir el mapa del sitio, para dimensionar la magnitud y el alcance del proyecto que se va a realizar, tambi&eacute;n nos permite crear la estructura y las tecnolog&iacute;as que debemos utilizar para nuestra p&aacute;gina web.</p>
       </font>

       <h2>Fase3: Dise&ntilde;o</h2>
       <font size="+2">
       <p>* Durante esta etapa debemos concentrarnos en el dise&ntilde;o visual del sitio, que tenga una comunicaci&oacute;n clara, colores que representen la marca o producto. Es importante centrarce en la utilización de los principios de la usabilidad (facilidad de uso para el usuario) ,UI (interfaz de usuario) y UX (experiencia del usuario), estos permiten que ademas del dise&ntilde;o gr&aacute;fico, el sitio web sea funcional y m&aacute;s efectivo.</p></font>

        <h2>Fase4: Contenidos</h2>
        <font size="+2">
       <p>* En esta etapa debemos concentrarnos en la redacci&oacute;n de textos correctamente, inclusi&oacute;n de im&aacute;genes, videos con optimizaci&oacute;n para la web y la optimizaci&oacute;n para motores de b&uacute;squeda (SEO). Los contenidos son la materia prima de nuestro proyecto, de estos depende en gran parte el &eacute;xito porque al fin y al cabo es lo que nuestros usuarios utilizar&aacute;n.</p></font>

        <h2>Fase5: Desarrollo</h2>
        <font size="+2">
       <p>* En este punto se desarrolla el sitio utilizando lenguajes de programaci&oacute;n como HTML, CSS, PHP y bases de datos. Tambi&eacute;n es importante aspectos funcionales como el dise&ntilde;o adaptativo (responsive size), esto permitir&aacute; tener compatibilidad con dispositivos m&oacute;viles y llegar a una mayor cantidad de usuarios.</p></font>

        <h2>Fase6: Pruebas</h2>
        <font size="+2">
       <p>* Se deben realizar pruebas t&eacute;cnicas para el funcionamiento adecuado de la p&aacute;gina web, se revisa la compatibilidad con los navegadores web y muy importante revisar si el sitio web cumple con el prop&oacute;sito que se plantea en los objetivos iniciales.</p></font>

        <h2>Fase7: Lanzamiento</h2>
        <font size="+2">
       <p>* Una vez se publique el sitio web en internet para el p&uacute;blico, se debe realizar un monitoreo constante para evitar fallas t&eacute;cnicas o realizar algún ajuste. Tambi&eacute;n es necesario el mantenimiento del sitio web no solo en temas t&eacute;cnicos sino en actualizaci&oacute;n de contenidos.</p></font>

<br>
<br>
</body>
</html>

